layer {
  name: "RGB"
  type: "Python"
  top: "RGB"
  top: "DEP"
  python_param {
    module: "nyud_layers"
    layer: "NYUDSegDataLayer"
    param_str: "{\'do_test_scale\': 1.2, \'seed\': 1337, \'do_aug\': True, \'nyud_dir\': \'./data\', \'tops\': [\'color\', \'hha\'], \'split\': \'test\'}"
  }
}
layer {
  name: "RGBconv1"
  type: "Convolution"
  bottom: "RGB"
  top: "RGBconv1"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
  }
}
layer {
  name: "RGBbn_conv1"
  type: "BatchNorm"
  bottom: "RGBconv1"
  top: "RGBconv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale_conv1"
  type: "Scale"
  bottom: "RGBconv1"
  top: "RGBconv1"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBconv1_relu"
  type: "ReLU"
  bottom: "RGBconv1"
  top: "RGBconv1"
}
layer {
  name: "RGBpool1"
  type: "Pooling"
  bottom: "RGBconv1"
  top: "RGBpool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "RGBres2a_branch1"
  type: "Convolution"
  bottom: "RGBpool1"
  top: "RGBres2a_branch1"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn2a_branch1"
  type: "BatchNorm"
  bottom: "RGBres2a_branch1"
  top: "RGBres2a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale2a_branch1"
  type: "Scale"
  bottom: "RGBres2a_branch1"
  top: "RGBres2a_branch1"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres2a_branch2a"
  type: "Convolution"
  bottom: "RGBpool1"
  top: "RGBres2a_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn2a_branch2a"
  type: "BatchNorm"
  bottom: "RGBres2a_branch2a"
  top: "RGBres2a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale2a_branch2a"
  type: "Scale"
  bottom: "RGBres2a_branch2a"
  top: "RGBres2a_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres2a_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres2a_branch2a"
  top: "RGBres2a_branch2a"
}
layer {
  name: "RGBres2a_branch2b"
  type: "Convolution"
  bottom: "RGBres2a_branch2a"
  top: "RGBres2a_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn2a_branch2b"
  type: "BatchNorm"
  bottom: "RGBres2a_branch2b"
  top: "RGBres2a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale2a_branch2b"
  type: "Scale"
  bottom: "RGBres2a_branch2b"
  top: "RGBres2a_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres2a_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres2a_branch2b"
  top: "RGBres2a_branch2b"
}
layer {
  name: "RGBres2a_branch2c"
  type: "Convolution"
  bottom: "RGBres2a_branch2b"
  top: "RGBres2a_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn2a_branch2c"
  type: "BatchNorm"
  bottom: "RGBres2a_branch2c"
  top: "RGBres2a_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale2a_branch2c"
  type: "Scale"
  bottom: "RGBres2a_branch2c"
  top: "RGBres2a_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres2a"
  type: "Eltwise"
  bottom: "RGBres2a_branch1"
  bottom: "RGBres2a_branch2c"
  top: "RGBres2a"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres2a_relu"
  type: "ReLU"
  bottom: "RGBres2a"
  top: "RGBres2a"
}
layer {
  name: "RGBres2b_branch2a"
  type: "Convolution"
  bottom: "RGBres2a"
  top: "RGBres2b_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn2b_branch2a"
  type: "BatchNorm"
  bottom: "RGBres2b_branch2a"
  top: "RGBres2b_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale2b_branch2a"
  type: "Scale"
  bottom: "RGBres2b_branch2a"
  top: "RGBres2b_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres2b_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres2b_branch2a"
  top: "RGBres2b_branch2a"
}
layer {
  name: "RGBres2b_branch2b"
  type: "Convolution"
  bottom: "RGBres2b_branch2a"
  top: "RGBres2b_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn2b_branch2b"
  type: "BatchNorm"
  bottom: "RGBres2b_branch2b"
  top: "RGBres2b_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale2b_branch2b"
  type: "Scale"
  bottom: "RGBres2b_branch2b"
  top: "RGBres2b_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres2b_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres2b_branch2b"
  top: "RGBres2b_branch2b"
}
layer {
  name: "RGBres2b_branch2c"
  type: "Convolution"
  bottom: "RGBres2b_branch2b"
  top: "RGBres2b_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn2b_branch2c"
  type: "BatchNorm"
  bottom: "RGBres2b_branch2c"
  top: "RGBres2b_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale2b_branch2c"
  type: "Scale"
  bottom: "RGBres2b_branch2c"
  top: "RGBres2b_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres2b"
  type: "Eltwise"
  bottom: "RGBres2a"
  bottom: "RGBres2b_branch2c"
  top: "RGBres2b"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres2b_relu"
  type: "ReLU"
  bottom: "RGBres2b"
  top: "RGBres2b"
}
layer {
  name: "RGBres2c_branch2a"
  type: "Convolution"
  bottom: "RGBres2b"
  top: "RGBres2c_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn2c_branch2a"
  type: "BatchNorm"
  bottom: "RGBres2c_branch2a"
  top: "RGBres2c_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale2c_branch2a"
  type: "Scale"
  bottom: "RGBres2c_branch2a"
  top: "RGBres2c_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres2c_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres2c_branch2a"
  top: "RGBres2c_branch2a"
}
layer {
  name: "RGBres2c_branch2b"
  type: "Convolution"
  bottom: "RGBres2c_branch2a"
  top: "RGBres2c_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn2c_branch2b"
  type: "BatchNorm"
  bottom: "RGBres2c_branch2b"
  top: "RGBres2c_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale2c_branch2b"
  type: "Scale"
  bottom: "RGBres2c_branch2b"
  top: "RGBres2c_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres2c_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres2c_branch2b"
  top: "RGBres2c_branch2b"
}
layer {
  name: "RGBres2c_branch2c"
  type: "Convolution"
  bottom: "RGBres2c_branch2b"
  top: "RGBres2c_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn2c_branch2c"
  type: "BatchNorm"
  bottom: "RGBres2c_branch2c"
  top: "RGBres2c_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale2c_branch2c"
  type: "Scale"
  bottom: "RGBres2c_branch2c"
  top: "RGBres2c_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres2c"
  type: "Eltwise"
  bottom: "RGBres2b"
  bottom: "RGBres2c_branch2c"
  top: "RGBres2c"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres2c_relu"
  type: "ReLU"
  bottom: "RGBres2c"
  top: "RGBres2c"
}
layer {
  name: "RGBres3a_branch1"
  type: "Convolution"
  bottom: "RGBres2c"
  top: "RGBres3a_branch1"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "RGBbn3a_branch1"
  type: "BatchNorm"
  bottom: "RGBres3a_branch1"
  top: "RGBres3a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3a_branch1"
  type: "Scale"
  bottom: "RGBres3a_branch1"
  top: "RGBres3a_branch1"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3a_branch2a"
  type: "Convolution"
  bottom: "RGBres2c"
  top: "RGBres3a_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "RGBbn3a_branch2a"
  type: "BatchNorm"
  bottom: "RGBres3a_branch2a"
  top: "RGBres3a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3a_branch2a"
  type: "Scale"
  bottom: "RGBres3a_branch2a"
  top: "RGBres3a_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3a_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres3a_branch2a"
  top: "RGBres3a_branch2a"
}
layer {
  name: "RGBres3a_branch2b"
  type: "Convolution"
  bottom: "RGBres3a_branch2a"
  top: "RGBres3a_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn3a_branch2b"
  type: "BatchNorm"
  bottom: "RGBres3a_branch2b"
  top: "RGBres3a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3a_branch2b"
  type: "Scale"
  bottom: "RGBres3a_branch2b"
  top: "RGBres3a_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3a_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres3a_branch2b"
  top: "RGBres3a_branch2b"
}
layer {
  name: "RGBres3a_branch2c"
  type: "Convolution"
  bottom: "RGBres3a_branch2b"
  top: "RGBres3a_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3a_branch2c"
  type: "BatchNorm"
  bottom: "RGBres3a_branch2c"
  top: "RGBres3a_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3a_branch2c"
  type: "Scale"
  bottom: "RGBres3a_branch2c"
  top: "RGBres3a_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3a"
  type: "Eltwise"
  bottom: "RGBres3a_branch1"
  bottom: "RGBres3a_branch2c"
  top: "RGBres3a"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres3a_relu"
  type: "ReLU"
  bottom: "RGBres3a"
  top: "RGBres3a"
}
layer {
  name: "RGBres3b1_branch2a"
  type: "Convolution"
  bottom: "RGBres3a"
  top: "RGBres3b1_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b1_branch2a"
  type: "BatchNorm"
  bottom: "RGBres3b1_branch2a"
  top: "RGBres3b1_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b1_branch2a"
  type: "Scale"
  bottom: "RGBres3b1_branch2a"
  top: "RGBres3b1_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b1_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres3b1_branch2a"
  top: "RGBres3b1_branch2a"
}
layer {
  name: "RGBres3b1_branch2b"
  type: "Convolution"
  bottom: "RGBres3b1_branch2a"
  top: "RGBres3b1_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn3b1_branch2b"
  type: "BatchNorm"
  bottom: "RGBres3b1_branch2b"
  top: "RGBres3b1_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b1_branch2b"
  type: "Scale"
  bottom: "RGBres3b1_branch2b"
  top: "RGBres3b1_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b1_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres3b1_branch2b"
  top: "RGBres3b1_branch2b"
}
layer {
  name: "RGBres3b1_branch2c"
  type: "Convolution"
  bottom: "RGBres3b1_branch2b"
  top: "RGBres3b1_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b1_branch2c"
  type: "BatchNorm"
  bottom: "RGBres3b1_branch2c"
  top: "RGBres3b1_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b1_branch2c"
  type: "Scale"
  bottom: "RGBres3b1_branch2c"
  top: "RGBres3b1_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b1"
  type: "Eltwise"
  bottom: "RGBres3a"
  bottom: "RGBres3b1_branch2c"
  top: "RGBres3b1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres3b1_relu"
  type: "ReLU"
  bottom: "RGBres3b1"
  top: "RGBres3b1"
}
layer {
  name: "RGBres3b2_branch2a"
  type: "Convolution"
  bottom: "RGBres3b1"
  top: "RGBres3b2_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b2_branch2a"
  type: "BatchNorm"
  bottom: "RGBres3b2_branch2a"
  top: "RGBres3b2_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b2_branch2a"
  type: "Scale"
  bottom: "RGBres3b2_branch2a"
  top: "RGBres3b2_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b2_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres3b2_branch2a"
  top: "RGBres3b2_branch2a"
}
layer {
  name: "RGBres3b2_branch2b"
  type: "Convolution"
  bottom: "RGBres3b2_branch2a"
  top: "RGBres3b2_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn3b2_branch2b"
  type: "BatchNorm"
  bottom: "RGBres3b2_branch2b"
  top: "RGBres3b2_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b2_branch2b"
  type: "Scale"
  bottom: "RGBres3b2_branch2b"
  top: "RGBres3b2_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b2_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres3b2_branch2b"
  top: "RGBres3b2_branch2b"
}
layer {
  name: "RGBres3b2_branch2c"
  type: "Convolution"
  bottom: "RGBres3b2_branch2b"
  top: "RGBres3b2_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b2_branch2c"
  type: "BatchNorm"
  bottom: "RGBres3b2_branch2c"
  top: "RGBres3b2_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b2_branch2c"
  type: "Scale"
  bottom: "RGBres3b2_branch2c"
  top: "RGBres3b2_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b2"
  type: "Eltwise"
  bottom: "RGBres3b1"
  bottom: "RGBres3b2_branch2c"
  top: "RGBres3b2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres3b2_relu"
  type: "ReLU"
  bottom: "RGBres3b2"
  top: "RGBres3b2"
}
layer {
  name: "RGBres3b3_branch2a"
  type: "Convolution"
  bottom: "RGBres3b2"
  top: "RGBres3b3_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b3_branch2a"
  type: "BatchNorm"
  bottom: "RGBres3b3_branch2a"
  top: "RGBres3b3_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b3_branch2a"
  type: "Scale"
  bottom: "RGBres3b3_branch2a"
  top: "RGBres3b3_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b3_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres3b3_branch2a"
  top: "RGBres3b3_branch2a"
}
layer {
  name: "RGBres3b3_branch2b"
  type: "Convolution"
  bottom: "RGBres3b3_branch2a"
  top: "RGBres3b3_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn3b3_branch2b"
  type: "BatchNorm"
  bottom: "RGBres3b3_branch2b"
  top: "RGBres3b3_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b3_branch2b"
  type: "Scale"
  bottom: "RGBres3b3_branch2b"
  top: "RGBres3b3_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b3_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres3b3_branch2b"
  top: "RGBres3b3_branch2b"
}
layer {
  name: "RGBres3b3_branch2c"
  type: "Convolution"
  bottom: "RGBres3b3_branch2b"
  top: "RGBres3b3_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b3_branch2c"
  type: "BatchNorm"
  bottom: "RGBres3b3_branch2c"
  top: "RGBres3b3_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b3_branch2c"
  type: "Scale"
  bottom: "RGBres3b3_branch2c"
  top: "RGBres3b3_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b3"
  type: "Eltwise"
  bottom: "RGBres3b2"
  bottom: "RGBres3b3_branch2c"
  top: "RGBres3b3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres3b3_relu"
  type: "ReLU"
  bottom: "RGBres3b3"
  top: "RGBres3b3"
}
layer {
  name: "RGBres3b4_branch2a"
  type: "Convolution"
  bottom: "RGBres3b3"
  top: "RGBres3b4_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b4_branch2a"
  type: "BatchNorm"
  bottom: "RGBres3b4_branch2a"
  top: "RGBres3b4_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b4_branch2a"
  type: "Scale"
  bottom: "RGBres3b4_branch2a"
  top: "RGBres3b4_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b4_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres3b4_branch2a"
  top: "RGBres3b4_branch2a"
}
layer {
  name: "RGBres3b4_branch2b"
  type: "Convolution"
  bottom: "RGBres3b4_branch2a"
  top: "RGBres3b4_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn3b4_branch2b"
  type: "BatchNorm"
  bottom: "RGBres3b4_branch2b"
  top: "RGBres3b4_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b4_branch2b"
  type: "Scale"
  bottom: "RGBres3b4_branch2b"
  top: "RGBres3b4_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b4_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres3b4_branch2b"
  top: "RGBres3b4_branch2b"
}
layer {
  name: "RGBres3b4_branch2c"
  type: "Convolution"
  bottom: "RGBres3b4_branch2b"
  top: "RGBres3b4_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b4_branch2c"
  type: "BatchNorm"
  bottom: "RGBres3b4_branch2c"
  top: "RGBres3b4_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b4_branch2c"
  type: "Scale"
  bottom: "RGBres3b4_branch2c"
  top: "RGBres3b4_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b4"
  type: "Eltwise"
  bottom: "RGBres3b3"
  bottom: "RGBres3b4_branch2c"
  top: "RGBres3b4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres3b4_relu"
  type: "ReLU"
  bottom: "RGBres3b4"
  top: "RGBres3b4"
}
layer {
  name: "RGBres3b5_branch2a"
  type: "Convolution"
  bottom: "RGBres3b4"
  top: "RGBres3b5_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b5_branch2a"
  type: "BatchNorm"
  bottom: "RGBres3b5_branch2a"
  top: "RGBres3b5_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b5_branch2a"
  type: "Scale"
  bottom: "RGBres3b5_branch2a"
  top: "RGBres3b5_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b5_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres3b5_branch2a"
  top: "RGBres3b5_branch2a"
}
layer {
  name: "RGBres3b5_branch2b"
  type: "Convolution"
  bottom: "RGBres3b5_branch2a"
  top: "RGBres3b5_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn3b5_branch2b"
  type: "BatchNorm"
  bottom: "RGBres3b5_branch2b"
  top: "RGBres3b5_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b5_branch2b"
  type: "Scale"
  bottom: "RGBres3b5_branch2b"
  top: "RGBres3b5_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b5_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres3b5_branch2b"
  top: "RGBres3b5_branch2b"
}
layer {
  name: "RGBres3b5_branch2c"
  type: "Convolution"
  bottom: "RGBres3b5_branch2b"
  top: "RGBres3b5_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b5_branch2c"
  type: "BatchNorm"
  bottom: "RGBres3b5_branch2c"
  top: "RGBres3b5_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b5_branch2c"
  type: "Scale"
  bottom: "RGBres3b5_branch2c"
  top: "RGBres3b5_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b5"
  type: "Eltwise"
  bottom: "RGBres3b4"
  bottom: "RGBres3b5_branch2c"
  top: "RGBres3b5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres3b5_relu"
  type: "ReLU"
  bottom: "RGBres3b5"
  top: "RGBres3b5"
}
layer {
  name: "RGBres3b6_branch2a"
  type: "Convolution"
  bottom: "RGBres3b5"
  top: "RGBres3b6_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b6_branch2a"
  type: "BatchNorm"
  bottom: "RGBres3b6_branch2a"
  top: "RGBres3b6_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b6_branch2a"
  type: "Scale"
  bottom: "RGBres3b6_branch2a"
  top: "RGBres3b6_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b6_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres3b6_branch2a"
  top: "RGBres3b6_branch2a"
}
layer {
  name: "RGBres3b6_branch2b"
  type: "Convolution"
  bottom: "RGBres3b6_branch2a"
  top: "RGBres3b6_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn3b6_branch2b"
  type: "BatchNorm"
  bottom: "RGBres3b6_branch2b"
  top: "RGBres3b6_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b6_branch2b"
  type: "Scale"
  bottom: "RGBres3b6_branch2b"
  top: "RGBres3b6_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b6_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres3b6_branch2b"
  top: "RGBres3b6_branch2b"
}
layer {
  name: "RGBres3b6_branch2c"
  type: "Convolution"
  bottom: "RGBres3b6_branch2b"
  top: "RGBres3b6_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b6_branch2c"
  type: "BatchNorm"
  bottom: "RGBres3b6_branch2c"
  top: "RGBres3b6_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b6_branch2c"
  type: "Scale"
  bottom: "RGBres3b6_branch2c"
  top: "RGBres3b6_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b6"
  type: "Eltwise"
  bottom: "RGBres3b5"
  bottom: "RGBres3b6_branch2c"
  top: "RGBres3b6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres3b6_relu"
  type: "ReLU"
  bottom: "RGBres3b6"
  top: "RGBres3b6"
}
layer {
  name: "RGBres3b7_branch2a"
  type: "Convolution"
  bottom: "RGBres3b6"
  top: "RGBres3b7_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b7_branch2a"
  type: "BatchNorm"
  bottom: "RGBres3b7_branch2a"
  top: "RGBres3b7_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b7_branch2a"
  type: "Scale"
  bottom: "RGBres3b7_branch2a"
  top: "RGBres3b7_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b7_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres3b7_branch2a"
  top: "RGBres3b7_branch2a"
}
layer {
  name: "RGBres3b7_branch2b"
  type: "Convolution"
  bottom: "RGBres3b7_branch2a"
  top: "RGBres3b7_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn3b7_branch2b"
  type: "BatchNorm"
  bottom: "RGBres3b7_branch2b"
  top: "RGBres3b7_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b7_branch2b"
  type: "Scale"
  bottom: "RGBres3b7_branch2b"
  top: "RGBres3b7_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b7_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres3b7_branch2b"
  top: "RGBres3b7_branch2b"
}
layer {
  name: "RGBres3b7_branch2c"
  type: "Convolution"
  bottom: "RGBres3b7_branch2b"
  top: "RGBres3b7_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn3b7_branch2c"
  type: "BatchNorm"
  bottom: "RGBres3b7_branch2c"
  top: "RGBres3b7_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale3b7_branch2c"
  type: "Scale"
  bottom: "RGBres3b7_branch2c"
  top: "RGBres3b7_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres3b7"
  type: "Eltwise"
  bottom: "RGBres3b6"
  bottom: "RGBres3b7_branch2c"
  top: "RGBres3b7"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres3b7_relu"
  type: "ReLU"
  bottom: "RGBres3b7"
  top: "RGBres3b7"
}
layer {
  name: "RGBres4a_branch1"
  type: "Convolution"
  bottom: "RGBres3b7"
  top: "RGBres4a_branch1"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "RGBbn4a_branch1"
  type: "BatchNorm"
  bottom: "RGBres4a_branch1"
  top: "RGBres4a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4a_branch1"
  type: "Scale"
  bottom: "RGBres4a_branch1"
  top: "RGBres4a_branch1"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4a_branch2a"
  type: "Convolution"
  bottom: "RGBres3b7"
  top: "RGBres4a_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "RGBbn4a_branch2a"
  type: "BatchNorm"
  bottom: "RGBres4a_branch2a"
  top: "RGBres4a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4a_branch2a"
  type: "Scale"
  bottom: "RGBres4a_branch2a"
  top: "RGBres4a_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4a_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres4a_branch2a"
  top: "RGBres4a_branch2a"
}
layer {
  name: "RGBres4a_branch2b"
  type: "Convolution"
  bottom: "RGBres4a_branch2a"
  top: "RGBres4a_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn4a_branch2b"
  type: "BatchNorm"
  bottom: "RGBres4a_branch2b"
  top: "RGBres4a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4a_branch2b"
  type: "Scale"
  bottom: "RGBres4a_branch2b"
  top: "RGBres4a_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4a_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres4a_branch2b"
  top: "RGBres4a_branch2b"
}
layer {
  name: "RGBres4a_branch2c"
  type: "Convolution"
  bottom: "RGBres4a_branch2b"
  top: "RGBres4a_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn4a_branch2c"
  type: "BatchNorm"
  bottom: "RGBres4a_branch2c"
  top: "RGBres4a_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4a_branch2c"
  type: "Scale"
  bottom: "RGBres4a_branch2c"
  top: "RGBres4a_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4a"
  type: "Eltwise"
  bottom: "RGBres4a_branch1"
  bottom: "RGBres4a_branch2c"
  top: "RGBres4a"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres4a_relu"
  type: "ReLU"
  bottom: "RGBres4a"
  top: "RGBres4a"
}
layer {
  name: "RGBres4b1_branch2a"
  type: "Convolution"
  bottom: "RGBres4a"
  top: "RGBres4b1_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn4b1_branch2a"
  type: "BatchNorm"
  bottom: "RGBres4b1_branch2a"
  top: "RGBres4b1_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4b1_branch2a"
  type: "Scale"
  bottom: "RGBres4b1_branch2a"
  top: "RGBres4b1_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4b1_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres4b1_branch2a"
  top: "RGBres4b1_branch2a"
}
layer {
  name: "RGBres4b1_branch2b"
  type: "Convolution"
  bottom: "RGBres4b1_branch2a"
  top: "RGBres4b1_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn4b1_branch2b"
  type: "BatchNorm"
  bottom: "RGBres4b1_branch2b"
  top: "RGBres4b1_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4b1_branch2b"
  type: "Scale"
  bottom: "RGBres4b1_branch2b"
  top: "RGBres4b1_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4b1_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres4b1_branch2b"
  top: "RGBres4b1_branch2b"
}
layer {
  name: "RGBres4b1_branch2c"
  type: "Convolution"
  bottom: "RGBres4b1_branch2b"
  top: "RGBres4b1_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn4b1_branch2c"
  type: "BatchNorm"
  bottom: "RGBres4b1_branch2c"
  top: "RGBres4b1_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4b1_branch2c"
  type: "Scale"
  bottom: "RGBres4b1_branch2c"
  top: "RGBres4b1_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4b1"
  type: "Eltwise"
  bottom: "RGBres4a"
  bottom: "RGBres4b1_branch2c"
  top: "RGBres4b1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres4b1_relu"
  type: "ReLU"
  bottom: "RGBres4b1"
  top: "RGBres4b1"
}
layer {
  name: "RGBres4b2_branch2a"
  type: "Convolution"
  bottom: "RGBres4b1"
  top: "RGBres4b2_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn4b2_branch2a"
  type: "BatchNorm"
  bottom: "RGBres4b2_branch2a"
  top: "RGBres4b2_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4b2_branch2a"
  type: "Scale"
  bottom: "RGBres4b2_branch2a"
  top: "RGBres4b2_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4b2_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres4b2_branch2a"
  top: "RGBres4b2_branch2a"
}
layer {
  name: "RGBres4b2_branch2b"
  type: "Convolution"
  bottom: "RGBres4b2_branch2a"
  top: "RGBres4b2_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn4b2_branch2b"
  type: "BatchNorm"
  bottom: "RGBres4b2_branch2b"
  top: "RGBres4b2_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4b2_branch2b"
  type: "Scale"
  bottom: "RGBres4b2_branch2b"
  top: "RGBres4b2_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4b2_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres4b2_branch2b"
  top: "RGBres4b2_branch2b"
}
layer {
  name: "RGBres4b2_branch2c"
  type: "Convolution"
  bottom: "RGBres4b2_branch2b"
  top: "RGBres4b2_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn4b2_branch2c"
  type: "BatchNorm"
  bottom: "RGBres4b2_branch2c"
  top: "RGBres4b2_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4b2_branch2c"
  type: "Scale"
  bottom: "RGBres4b2_branch2c"
  top: "RGBres4b2_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4b2"
  type: "Eltwise"
  bottom: "RGBres4b1"
  bottom: "RGBres4b2_branch2c"
  top: "RGBres4b2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres4b2_relu"
  type: "ReLU"
  bottom: "RGBres4b2"
  top: "RGBres4b2"
}
layer {
  name: "RGBres4b3_branch2a"
  type: "Convolution"
  bottom: "RGBres4b2"
  top: "RGBres4b3_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn4b3_branch2a"
  type: "BatchNorm"
  bottom: "RGBres4b3_branch2a"
  top: "RGBres4b3_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4b3_branch2a"
  type: "Scale"
  bottom: "RGBres4b3_branch2a"
  top: "RGBres4b3_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4b3_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres4b3_branch2a"
  top: "RGBres4b3_branch2a"
}
layer {
  name: "RGBres4b3_branch2b"
  type: "Convolution"
  bottom: "RGBres4b3_branch2a"
  top: "RGBres4b3_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "RGBbn4b3_branch2b"
  type: "BatchNorm"
  bottom: "RGBres4b3_branch2b"
  top: "RGBres4b3_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4b3_branch2b"
  type: "Scale"
  bottom: "RGBres4b3_branch2b"
  top: "RGBres4b3_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4b3_branch2b_relu"
  type: "ReLU"
  bottom: "RGBres4b3_branch2b"
  top: "RGBres4b3_branch2b"
}
layer {
  name: "RGBres4b3_branch2c"
  type: "Convolution"
  bottom: "RGBres4b3_branch2b"
  top: "RGBres4b3_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn4b3_branch2c"
  type: "BatchNorm"
  bottom: "RGBres4b3_branch2c"
  top: "RGBres4b3_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4b3_branch2c"
  type: "Scale"
  bottom: "RGBres4b3_branch2c"
  top: "RGBres4b3_branch2c"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4b3"
  type: "Eltwise"
  bottom: "RGBres4b2"
  bottom: "RGBres4b3_branch2c"
  top: "RGBres4b3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "RGBres4b3_relu"
  type: "ReLU"
  bottom: "RGBres4b3"
  top: "RGBres4b3"
}
layer {
  name: "RGBres4b4_branch2a"
  type: "Convolution"
  bottom: "RGBres4b3"
  top: "RGBres4b4_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "RGBbn4b4_branch2a"
  type: "BatchNorm"
  bottom: "RGBres4b4_branch2a"
  top: "RGBres4b4_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "RGBscale4b4_branch2a"
  type: "Scale"
  bottom: "RGBres4b4_branch2a"
  top: "RGBres4b4_branch2a"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "RGBres4b4_branch2a_relu"
  type: "ReLU"
  bottom: "RGBres4b4_branch2a"
  top: "RGBres4b4_branch2a"
}
layer {
  name: "RGBres4b4_branch2b"
  type: "Convolution"
  bottom: "RGBres4b4_branch2a"
  top: "RGBres4b4_branch2b"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
